package pag_doc;

/**
 * Лексика в java;<br>Текст на java состоит из
 * пробелов,идентификаторов,литералов,комментариев,операторов,разделителей,
 * ключевых слов<br>Пробелы-требований нет<br>Для именования классов,методов и
 * переменных служат идентификаторы<br>Идентификатором может быть любая
 * последовательность строчных и прописных букв, цифр или символов подчеркивания
 * и денежной единицы (Знак денежной единицы не предназначается для общего
 * использования)<br> Идентификаторы не должны начинаться с цифры, чтобы
 * компилятор не путал их с числовыми константами<br>Литералы-постоянные
 * значения<br>Комментарии:<br>//однострочный<br>/*многострочный<br>/**документирующий<br>Разделители:<br>
 * ()-для передачи списков параметров в определениях и вызовах
 * методов,приведения типов<br>
 * {}-инициализация массивов,блоков кода, классов, методов и локальных областей
 * действия<br>
 * []-для объявления типов массивов и обращении к элементам массивов<br>
 * ;-Завершает операторы<br>
 * ,- запятая разделитель<br>
 * -точка оператор<br>Ключевые слова;Определенно 50 слов которые нельзя
 * использовать в качестве идентификаторов, переменных, классов и
 * методов<br>Библиотеки классо в Java Java опирается на несколько встроенных
 * библиотек классов, содержащих многие встроенные методы, обеспечивающие
 * подцержку таких операций, как ввод-вывод, обработка символьных строк, работа
 * в сети и отображение графики
 *
 */
public class Doc {

}
