package pag_doc;

/**
 * Литералы,константы,которые записаны по правилам языка Java<br>Логические
 * литералы:<br> true — истина<br> false — ложь;<br>Целочисленные литералы<br>
 * десятичные числа(по основанию 10)123 +2 -1<br>восьмеричные(по основанию 8),
 * начинается с 0, а дальше запись числа, например 01234567 или
 * -01234567<br>Шестнадцатеричные(по основанию 16) словам по длине 8,16,32 и 64
 * бит,состоящим из 8-разрядных блоков,Значения шестнадцатеричных констант
 * обозначают начальным нулем и символом х (Ох или ОХ),Шестнадцатеричные цифры
 * должны указываться в пределах от О до 1 5, поэтому цифры от 1 0 до 15
 * заменяют буквами от А до F (или от а до :f)<br>целочисленные литералы можно
 * определить в двоичной форме,Для этого перед присваиваемым значением
 * указывается префикс ОЬ или ОВ, Например значение 10 определяется с помощью
 * двоичного литерала:int х = 0b1010;Можно указывать один знак подчеркивания или
 * более,При компиляции символы подчеркивания в литерале игнорируются,
 * <br>Литералы с плавающей точкой представляют десятичные значения с дробной
 * частью, Они могут быть выражены в стандартной или экспоненциальной (научной)
 * форме записи;Число в стаидартиай форме записи состоит из целого числа с
 * последующей десятичной точкой и дробной частью, Например 2.О, 0,314159 и
 * О.6667 представляют допустимые числа с плавающей точкой в стандартной записи;
 * В экспоненциальной форме записи используется стандартная форма записи чисел с
 * плавающей точкой дополненная суффиксом, обозначающим степень числа 10 на
 * которую следует умножить данное число; Для указания экспоненциальной части в
 * данной форме записи используется символ Е или е,за которым следует десятичное
 * число (положительное или отрицательное );Пример такой записи служит значения
 * 6.022Е23, 314159Е05 и 2е+100; По умолчанию в Java литералам с плавающей
 * точкой присваивается тип double, чтобы указать литерал типа float его следует
 * дополнить символом F или f; Литерал типа double можно также указать явно,
 * дополнив символом D или d; Значения по умолчанию-double занимают в
 * оперативной памяти 64 бита,тогда как для хранения значений более короткого
 * типа float требуется только 32 бита,можно вводить один знак подчеркивания или
 * больше, для облегчения чтения
 * <br>Символьные литералы-записывается в одинарных кавычках<br>"\ ddd"
 * восьмеричный символ(ddd)
 * <br>"\ uxxxx"-шестнадцатеричный символ в Юникоде (хххх)<br>\’ — одинарная
 * кавычка<br>\" — двойная кавычка<br>\\ — обратная косая черта<br>\r — символ
 * возврата каретки<br>\n — символ перевода строки<br>\t — символ
 * табуляции<br>\b — символ возврата курсора на один символ<br> Строковые
 * литералы-буквенный символ записанный в двойных кавычках

 */
public class Doc2 {
 public static void main(String args[]){
     int i=1;
     
 }
}
